In [1]:
import pandas as pd

In [2]:
original_df = pd.read_csv('Sales_Data.csv')
original_df.head()

,Unnamed: 0,Order ID,Product Category,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Sales,City,Hour,Time of Day
0,0,295665,Laptops and Computers,Macbook Pro Laptop,1,1700.00,30-12-2019 00:01,"136 Church St, New York City, NY 10001",12,1700.00,New York City,0,Night
1,1,295666,Home Appliances,LG Washing Machine,1,600.00,29-12-2019 07:03,"562 2nd St, New York City, NY 10001",12,600.00,New York City,7,Morning
2,2,295667,Charging Cables,USB-C Charging Cable,1,11.95,12-12-2019 18:21,"277 Main St, New York City, NY 10001",12,11.95,New York City,18,Evening
3,3,295668,Monitors,27in FHD Monitor,1,149.99,22-12-2019 15:13,"410 6th St, San Francisco, CA 94016",12,149.99,San Francisco,15,Afternoon
4,4,295669,Charging Cables,USB-C Charging Cable,1,11.95,18-12-2019 12:38,"43 Hill St, Atlanta, GA 30301",12,11.95,Atlanta,12,Afternoon

In [3]:
df = original_df.copy()
df = pd.read_csv('Sales_Data.csv')
print(df.shape)
print(df.columns)

(185950, 13)
Index(['Unnamed: 0', 'Order ID', 'Product Category', 'Product',
       'Quantity Ordered', 'Price Each', 'Order Date', 'Purchase Address',
       'Month', 'Sales', 'City', 'Hour', 'Time of Day'],
      dtype='object')

# Task: Load City-Wise Dataset

In [4]:
CityWise_sales = df[["City" , "Purchase Address" , "Order Date" , "Product Category"]].drop_duplicates()
CityWise_sales.shape

(185169, 4)

In [5]:
CityWise_sales.shape

(185169, 4)

In [6]:
CityWise_sales_clean = CityWise_sales.drop_duplicates().reset_index(drop=True)
CityWise_sales_clean.shape

(185169, 4)

In [7]:
CityWise_sales_clean.columns

Index(['City', 'Purchase Address', 'Order Date', 'Product Category'], dtype='object')

# City-wise Total Sales (Revenue)

In [8]:
city_sales = (df.groupby('City')['Sales'].sum().reset_index()
    .sort_values('Sales', ascending=False)
)

city_sales

             City       Sales
7   San Francisco  8262203.91
4     Los Angeles  5452570.80
5   New York City  4664317.43
2          Boston  3661642.01
0         Atlanta  2795498.58
3          Dallas  2767975.40
8         Seattle  2747755.48
6        Portland  2320490.61
1          Austin  1819581.75

# City-wise Order Count

In [9]:
city_orders = (df.groupby('City')['Order ID'] .count() .reset_index(name='Total Orders')
    .sort_values('Total Orders', ascending=False)
)
city_orders

             City  Total Orders
7   San Francisco         44732
4     Los Angeles         29605
5   New York City         24876
2          Boston         19934
0         Atlanta         14881
3          Dallas         14820
8         Seattle         14732
6        Portland         12465
1          Austin          9905

# City + Product Category Analysis

In [10]:
city_category_sales = (df.groupby(['City', 'Product Category'])['Sales'].sum()
    .reset_index()
)

city_category_sales

        City        Product Category      Sales
0    Atlanta           Audio Devices  317221.37
1    Atlanta                Batterie   15474.53
2    Atlanta         Charging Cables   50975.30
3    Atlanta   Entertainment Devices  122100.00
4    Atlanta         Home Appliances   66600.00
..       ...                     ...        ...
67   Seattle   Entertainment Devices  112500.00
68   Seattle         Home Appliances   68400.00
69   Seattle   Laptops and Computers  938196.67
70   Seattle                Monitors  535210.25
71   Seattle  Phones and Accessories  714200.00

[72 rows x 3 columns]

# Find Maximum (Top City)

In [11]:
top_city = city_sales.iloc[0]
top_city

City      San Francisco
Sales        8262203.91
Name: 7, dtype: object

# Best Product Category per City

In [12]:
city_category_sales = (df.groupby(['City', 'Product Category'])['Sales'].sum().reset_index()
)

top_category_city = city_category_sales.loc[
    city_category_sales.groupby('City')['Sales'].idxmax()
]

top_category_city

              City       Product Category       Sales
5          Atlanta  Laptops and Computers  1001296.43
13          Austin  Laptops and Computers   636697.90
21          Boston  Laptops and Computers  1261295.53
29          Dallas  Laptops and Computers   994396.55
37     Los Angeles  Laptops and Computers  1917693.59
45   New York City  Laptops and Computers  1676894.40
53        Portland  Laptops and Computers   846897.26
61   San Francisco  Laptops and Computers  2894190.37
69         Seattle  Laptops and Computers   938196.67

# Orders Trend by City Over Time

In [13]:
city_date_sales = (df.groupby(['City', 'Order Date'])['Sales'].sum() .reset_index()
)

city_date_sales.head()

       City        Order Date   Sales
0   Atlanta  01-01-2019 06:03   23.90
1   Atlanta  01-01-2019 06:13  700.00
2   Atlanta  01-01-2019 08:44  150.00
3   Atlanta  01-01-2019 09:33  700.00
4   Atlanta  01-01-2019 09:38    7.68

# Peak Purchase Date per City

In [14]:
peak_date_city = city_date_sales.loc[
    city_date_sales.groupby('City')['Sales'].idxmax()]
peak_date_city

                  City        Order Date    Sales
3778           Atlanta  09-05-2019 19:46  3400.00
19754           Austin  19-11-2019 12:00  2411.99
29425           Boston  10-11-2019 20:19  3400.00
53658           Dallas  26-09-2019 11:58  3400.00
78939      Los Angeles  26-08-2019 12:57  3400.00
97808    New York City  20-01-2019 00:15  3400.00
110687        Portland  11-12-2019 00:30  2411.99
153412   San Francisco  27-04-2019 21:01  3779.99
169030         Seattle  23-04-2019 19:23  3400.00